[
    "In 2011, InterActive+ was created(early called CXQStore)",
    "In 2012, I built the website for CXQStore(cxqstore.icoc.cc / www.cxqstore.com)",
    "In 2013, InterActive+ was formally created with its initial name WeisuoStudio. We majored in VB6.0 that time",
    "In 2014, WeiSuoStudio's website weisuostudio.xicp.net was built(It was very ugly!)",
    "In 2015, WeiSuoStudio started to post its products in BaiduTieba(The biggest forum in China that time)'s VB section. Until now, all of those products are unavailable to find. Simultaneously, xsyds.cn(Official site for InterActive+) was put online by using a single-page template.",
    "Apr 17, 2015, InterActive+ reorganized, and was renamed in Chinese(translation is similar to Interactive+)",
    "In the end of 2015, We started to use our own self-written website pages!(using Coyinsoft's Unistyle Framework)",
    "In 2016, we published SimTrap(a website framework based on Unistyle), and uses this framework to make our websites.",
    "In 2016, we published OPENAPI Server(allows 3rd-party developers to let their customers use Interactive+ accounts to login to the 3rd-party apps and store information on our cloud based on different accounts)",
    "In 2016, we changed our technology stack, our major changed from VB6.0 to HTML+PHP. There's a huge wave of people comming in and out.",
    "In the end of 2016, we deleted SimTrap and made METERIOT framework, this is a 100% self-written CSS/JS framework, we re-write our website using METERIOT and it is the first time we add language switching feature to the website",
    "July 26, 2017, we started operating BlueAirHost(a PHP hosting service) in China",
    "August 2017, we started writing Boost Full-stack framework, and that's going to boost our efficiency on writing websites.",
    "August 8, 2017, we re-organized again and improved our efficiency on team-work. And we had became a mature industry-standard operating team.",
    "October 2017, we launched Orange Search's 0.0001Alpha version, this search engine aims to bring users a sustainable, safe, private searching experience.",
    "June 2018, BlueAirHost starts using DNSSEC",
    "July 10, 2018, We started using domain interactiveplus.org and changed our website hosting to Github Pages. We renamed our team's English name from BlueAirTechGroup to InterActive+",
    "July 26, 2018, We launched our website of 2019.",
    "July 2018, we started planning for docs of InterActivePDK 2019.",
    "Sept 25 2018, InterActivePDK 2019 Backend(OPENAPI 4.0) finished its tests",
    "Dec 10 2018 ~ Feb 10 2019, We launched our new-year-themed website.(Yinglish theme)",
    "Jan 12 2019, Due to concern about compatibility of OAuth2.0, we decided to redesign OPENAPI4.0",
    "Apr 27 2019, We hosted our first team planning meeting. We changed our management structure to flat management. We decided to pause our webchat official account service and will try our best to keep up with our project progress by scheduling a meeting every week in the future.",
    "Apr 30 2019, We hosted our first project planning metting, and suggested our future plan for project development after finishing up OPENAPI4.0.",
    "July 5 2019, BlueAirHost rolled off",
    "Aug 12 2019, Interactive+ decided to make a IoT tutorial series called \"The Maker Advanture of a Bald Ginger Cat\"",
    "Aug 17 2019, Interacitve+ published the course introduction video of \"The Maker Advanture of a Bald Ginger Cat\" on Bilibili, a chinese video-sharing website.",
    "Apr 2 2020, Interactive+ published its second episode of \"Quick Science Post\", Distributed Computing and Covid-19, and is planning to publish it on Youtube in English later."
]